/*=============================================================================

ファイル管理[ FileManager.h ]

-------------------------------------------------------------------------------
■  Author
	Ohno Takuya

■  Create
	2017/08/25
=============================================================================*/

#ifndef _FILEMANAGER_H_
#define _FILEMANAGER_H_

/*-----------------------------------------------------------------------------
Include Files
-----------------------------------------------------------------------------*/
#include <fstream>

/*-----------------------------------------------------------------------------
Class
-----------------------------------------------------------------------------*/
class FileManager
{
public:
	/*-----------------------------------------------------------------------------
	Parameter:  std::ios_base::openmode
				  ファイルの開くときのモード
				  std::ios::in       読み込み専用で開く
				  std::ios::binary  バイナリモードで開く
				  std::ios::ate     開く時にEOFまで移動
	Overview:  ファイルの読み込み
	-----------------------------------------------------------------------------*/
	std::ifstream ReadFile(std::string fileName, const std::ios_base::openmode mode = std::ios::in);
	/*-----------------------------------------------------------------------------
	Parameter:  std::ios_base::openmode
				  ファイルの開くときのモード
				  std::ios::out    出力用にファイルを開く
				  std::ios::app    追加出力
				  std::ios::trunc  既存のファイルを上書き
	Overview:  ファイルの書き込み
	-----------------------------------------------------------------------------*/
	std::ofstream WriteFile(std::string fileName, const std::ios_base::openmode mode = std::ios::out);
};

#endif