/*=============================================================================

ライト(DirectX)[ LightDirectX.h ]

-------------------------------------------------------------------------------
■  Author
	Ohno Takuya

■  Create
	2017/10/16
=============================================================================*/

#ifndef _LIGHTDIRECTX_H_
#define _LIGHTDIRECTX_H_

/*-----------------------------------------------------------------------------
Class
-----------------------------------------------------------------------------*/
class LightDirectX
{
public:
	LightDirectX();

	void DirectionalLight(void);
	void PointLight(void); // ポイントライト

private:
	D3DLIGHT9 m_Light;	//	ライト構造体
};

#endif
