/*=============================================================================

ï®óùån[ Physics.h ]

-------------------------------------------------------------------------------
Å°  Author
Ohno Takuya

Å°  Create
2017/11/28
=============================================================================*/

#ifndef _PHYSICS_H_
#define _PHYSICS_H_

/*-----------------------------------------------------------------------------
Class
-----------------------------------------------------------------------------*/
class Physics
{
public:
	Physics(const float mass):m_Mass(mass){}
	void ObliqueProjectile(D3DXVECTOR3* Out, D3DXVECTOR3* Velocity); // éŒï˚ìäéÀ

private:
	float m_Mass; // éøó 
};

#endif
